{
  "_attn_implementation_autoset": true,
  "_name_or_path": "iiiorg/piiranha-v1-detect-personal-information",
  "architectures": [
    "DebertaV2ForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "I-ACCOUNTNUM",
    "1": "I-BUILDINGNUM",
    "2": "I-CITY",
    "3": "I-CREDITCARDNUMBER",
    "4": "I-DATEOFBIRTH",
    "5": "I-DRIVERLICENSENUM",
    "6": "I-EMAIL",
    "7": "I-GIVENNAME",
    "8": "I-IDCARDNUM",
    "9": "I-PASSWORD",
    "10": "I-SOCIALNUM",
    "11": "I-STREET",
    "12": "I-SURNAME",
    "13": "I-TAXNUM",
    "14": "I-TELEPHONENUM",
    "15": "I-USERNAME",
    "16": "I-ZIPCODE",
    "17": "O"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "I-ACCOUNTNUM": 0,
    "I-BUILDINGNUM": 1,
    "I-CITY": 2,
    "I-CREDITCARDNUMBER": 3,
    "I-DATEOFBIRTH": 4,
    "I-DRIVERLICENSENUM": 5,
    "I-EMAIL": 6,
    "I-GIVENNAME": 7,
    "I-IDCARDNUM": 8,
    "I-PASSWORD": 9,
    "I-SOCIALNUM": 10,
    "I-STREET": 11,
    "I-SURNAME": 12,
    "I-TAXNUM": 13,
    "I-TELEPHONENUM": 14,
    "I-USERNAME": 15,
    "I-ZIPCODE": 16,
    "O": 17
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "torch_dtype": "float32",
  "transformers_version": "4.49.0",
  "type_vocab_size": 0,
  "vocab_size": 251000
}
